In [6]:
import sqlite3
import pandas as pd 


#connection
conn = sqlite3.connect('./data/payroll.db')

conn2 = sqlite3.connect('./data/data.sqlite')

#cursor
cursor = conn.cursor()
cursor2 = conn2.cursor()

In [2]:
i = """ 
SELECT name 
FROM sqlite_master 
WHERE type = 'table';
"""

cursor.execute(i)

cursor.fetchall()

[('managers',), ('employees',)]

In [8]:
cursor2.execute(i)

cursor2.fetchall()

[('productlines',),
 ('offices',),
 ('customers',),
 ('employees',),
 ('orderdetails',),
 ('orders',),
 ('payments',),
 ('products',)]

In [4]:
q1 = """ 
SELECT * FROM managers;
"""

pd.read_sql_query(q1, conn).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      2 non-null      int64
 1   name    2 non-null      object
 2   pay     2 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 180.0+ bytes

In [ ]:
""" 
Technical Mentors

TM_ID   | first_name    | last_name  | TM_email 
1          Lians            Wanjiku     lm.@email.com  
*
*
* 
10
"""

In [ ]:
""" 
Students 

student_ID  | first_name    |   last_name   | student_email | age   |   course  | mode_of_study |    TM
1               Brian           Chacha          bc@email.com    33       DS         Hybrid          1
* 
* 
100
"""

70/90

' \nStudents \n\nstudent_ID  | first_name    |   last_name   | student_email | age   |   course  | mode_of_study |    TM\n1               Brian           Chacha          bc@email.com    33       DS         Hybrid          Lians\n* \n* \n\n'

In [10]:
query1 = """ 
SELECT * 
FROM managers;
"""

managers_df = pd.read_sql_query(query1, conn)


managers_df.head()

   id       name      pay
0   1      Steve   7000.0
1   2  Spongebob  10000.0

In [11]:
query2 = """ 
SELECT * 
FROM employees;
"""

employees_df = pd.read_sql_query(query2, conn)

employees_df.head()

   id     name     pay  manager_id
0   1      Bob  3000.0           1
1   2    Karen  4000.0           1
2   3  Patrick  4000.0           2

In [ ]:
#fetch data from both tables
query3 = """ 
SELECT a.id, a.name, a.pay, a.manager_id
FROM employees AS a, managers AS b
WHERE a.id = b.id;
"""


pd.read_sql_query(query3, conn)

   id   name     pay  manager_id
0   1    Bob  3000.0           1
1   2  Karen  4000.0           1

In [30]:
query3 = """
SELECT *
FROM employees
JOIN managers
    ON employees.manager_id = managers.id
;
"""
pd.read_sql(query3, conn)

   id     name     pay  manager_id  id       name      pay
0   1      Bob  3000.0           1   1      Steve   7000.0
1   2    Karen  4000.0           1   1      Steve   7000.0
2   3  Patrick  4000.0           2   2  Spongebob  10000.0

In [14]:
pd.read_sql_query(
""" 
SELECT * 
FROM employees
JOIN managers ON employees.manager_id = managers.id
;
"""
, conn)

   id     name     pay  manager_id  id       name      pay
0   1      Bob  3000.0           1   1      Steve   7000.0
1   2    Karen  4000.0           1   1      Steve   7000.0
2   3  Patrick  4000.0           2   2  Spongebob  10000.0

In [31]:
query3 = """
SELECT *
FROM employees
JOIN managers
    ON  managers.id = employees.manager_id
;
"""
pd.read_sql(query3, conn)

   id     name     pay  manager_id  id       name      pay
0   1      Bob  3000.0           1   1      Steve   7000.0
1   2    Karen  4000.0           1   1      Steve   7000.0
2   3  Patrick  4000.0           2   2  Spongebob  10000.0

In [17]:
pd.read_sql_query(""" 
SELECT customers.customerName, customers.phone, customers.state,
employees.firstName, employees.lastName, employees.email
FROM customers
JOIN employees ON customers.salesRepEmployeeNumber = employees.employeeNumber;
""", conn2).head()

,customerName,phone,state,firstName,lastName,email
0,Atelier graphique,40.32.2555,,Gerard,Hernandez,ghernande@classicmodelcars.com
1,Signal Gift Stores,7025551838,NV,Leslie,Thompson,lthompson@classicmodelcars.com
2,"Australian Collectors, Co.",03 9520 4555,Victoria,Andy,Fixter,afixter@classicmodelcars.com
3,La Rochelle Gifts,40.67.8555,,Gerard,Hernandez,ghernande@classicmodelcars.com
4,Baane Mini Imports,07-98 9555,,Barry,Jones,bjones@classicmodelcars.com

In [ ]:
pd.read_sql_query(""" 
SELECT customers.customerName, customers.phone, customers.state,
employees.firstName, employees.lastName, employees.email
FROM customers
JOIN employees ON customers.salesRepEmployeeNumber = employees.employeeNumber;
""", conn2).head()

In [ ]:
pd.read_sql_query(
""" 
SELECT c.customerName, c.phone, c.state
FROM customers AS c
;
"""    
, conn2).head()

                 customerName         phone     state
0           Atelier graphique    40.32.2555
1          Signal Gift Stores    7025551838        NV
2  Australian Collectors, Co.  03 9520 4555  Victoria
3           La Rochelle Gifts    40.67.8555
4          Baane Mini Imports    07-98 9555

In [ ]:
pd.read_sql_query(
""" 
SELECT c.customerName, c.phone, c.state,
    e.firstName, e.lastName, e.email

FROM customers AS c

JOIN employees AS e 

ON c.salesRepEmployeeNumber = e.employeeNumber
;
"""    
, conn2).head()

,customerName,phone,state,firstName,lastName,email
0,Atelier graphique,40.32.2555,,Gerard,Hernandez,ghernande@classicmodelcars.com
1,Signal Gift Stores,7025551838,NV,Leslie,Thompson,lthompson@classicmodelcars.com
2,"Australian Collectors, Co.",03 9520 4555,Victoria,Andy,Fixter,afixter@classicmodelcars.com
3,La Rochelle Gifts,40.67.8555,,Gerard,Hernandez,ghernande@classicmodelcars.com
4,Baane Mini Imports,07-98 9555,,Barry,Jones,bjones@classicmodelcars.com

In [ ]:
import pandas as pd

pd.read_sql_query()

In [ ]:
query3 = """
SELECT e.name, e.pay, m.name, m.pay
FROM employees AS e
JOIN managers AS m
ON e.manager_id = m.id;

"""

pd.read_sql_query(query3, conn)

### One to Many & Many to Many Relationship.

In [ ]:
#example 1
# payments - so that we can see how to join with 'using'

### Subquery

In [37]:
#example 1
complex1 = """ 
SELECT e.firstName, e.lastName, e.jobTitle
FROM employees e
JOIN offices o
     USING(officeCode)
WHERE o.country = 'France';
"""

french_df = pd.read_sql_query(complex1, conn2)

french_df.head()

  firstName   lastName             jobTitle
0    Gerard     Bondur  Sale Manager (EMEA)
1      Loui     Bondur            Sales Rep
2    Pamela   Castillo            Sales Rep
3    Martin     Gerard            Sales Rep
4    Gerard  Hernandez            Sales Rep

In [ ]:
simple1 = """ 
SELECT firstName, lastName, jobTitle
FROM employees
WHERE officeCode IN (
                     SELECT officeCode
                     FROM offices o
                     WHERE o.country = 'France'   
                    )
;
"""

french_df1 = pd.read_sql_query(simple1, conn2)

french_df1.head()

  firstName   lastName             jobTitle
0    Gerard     Bondur  Sale Manager (EMEA)
1      Loui     Bondur            Sales Rep
2    Gerard  Hernandez            Sales Rep
3    Pamela   Castillo            Sales Rep
4    Martin     Gerard            Sales Rep

In [32]:
df = pd.read_sql_query("""
SELECT country, state
FROM offices;
""", conn2)

df['country'].unique()

array(['USA', 'France', 'Japan', 'Australia', 'UK'], dtype=object)

In [ ]:
""" 
SELECT 
    c.customerName,
    SUM(od.quantityOrdered * od.priceEach) AS customerOrderTotal
FROM customers c
JOIN orders o ON c.customerNumber = o.customerNumber
JOIN orderdetails od ON o.orderNumber = od.orderNumber
GROUP BY c.customerName
HAVING SUM(od.quantityOrdered * od.priceEach) >
(
    SELECT AVG(order_total)
    FROM (
        SELECT 
            SUM(od2.quantityOrdered * od2.priceEach) AS order_total
        FROM orders o2
        JOIN orderdetails od2 
            ON o2.orderNumber = od2.orderNumber
        GROUP BY o2.orderNumber
    ) AS totals
);
"""